Repository: jburguete/jb
Catalog: 11.3.28/locale/*/LC_MESSAGES/jb.po
Languages: es

source: unable to open the file
es: no se pudo abrir el fichero

source: not enough memory to open the file
es: memoria insuficiente para abrir el fichero

source: unable to read the file
es: no se pudo leerr el fichero

source: Warning!
es: ¡Ojo!

source: unable to init SDL
es: no se pudo iniciar SDL

source: unable to init GLFW
es: no se pudo iniciar GLFW

source: unable to compile the texture fragment shader
es: no se pudo compilar el fragment shader de textura

source: unable to compile the texture vertex shader
es: no se pudo compilar el vertex shader de textura

source: unable to link the texture program
es: no se pudo enlazar el programa de textura

source: could not bind texture attribute
es: no se pudo enlazar el atributo de textura

source: could not bind texture position attribute
es: no se pudo enlazar el atributo de posición de textura

source: could not bind texture uniform
es: no se pudo enlazar la textura uniforme

source: could not bind matrix uniform
es: no se pudo enlazar la matriz uniforme

source: unable to open the PNG file
es: no se pudo abrir el fichero PNG

source: not enough memory to open the widget
es: memoria insuficiente para abrir el widget

source: not enough memory to open the image
es: memoria insuficiente para abrir la imagen

source: no Vulkan instance extensions supported
es: extensiones de instancia de Vulkan no soportadas

source: no VK_KHR_surface Vulkan extension
es: falta extensión VK_KHR_surface de Vulkan

source: no available Vulkan validation layers
es: capas de validación de Vulkan no disponibles

source: failed to create Vulkan instance
es: no se pudo crear la instancia de Vulkan

source: unable to create a Vulkan surface
es: no se pudo crear la superficie de Vulkan

source: failed to find a GPU with Vulkan support
es: no se pudo encontrar una GPU con soporte para Vulkan

source: bad Vulkan physical devices
es: dispositivos físicos de Vulkan incorrectos

source: no suitable Vulkan physical devices
es: dispositivos físicos de Vulkan no adecuados

source: no available Vulkan extension
es: extensión de Vulkan no disponible

source: no suitable Vulkan physical device queue family
es: familia de colas del dispositivo físico de Vulkan no adecuada

source: Vulkan device does not support surfaces
es: dispositivo de Vulkan no soporta superficies

source: unable to create the Vulkan logical device
es: no se pudo crear el dispositivo lógico de Vulkan

source: unable to create the Vulkan swap chain
es: no se pudo crear la cadena de intercambio de Vulkan

source: unable to create the Vulkan swap chain image view
es: no se pudo crear la vista de imagen de la cadena de intercambio de Vulkan

source: failed to find supported format
es: no se pudo encontrar un formato soportado

source: failed to create the Vulkan render pass
es: no se pudo crear el paso de renderización de Vulkan

source: failed to create the Vulkan descriptor set layout
es: no se pudo crear la capa del conjunto descriptor de Vulkan

source: failed to open the shader file
es: no se pudo abrir el fichero de shader

source: failed to create the Vulkan shader module
es: no se pudo crear el módulo de shader de Vulkan

source: OpenGL 2.1 is not supported
es: OpenGL 2.1 no está soportado

source: unable to compile the fragment shader
es: no se pudo compilar el fragment shader

source: unable to compile the 2D vertex shader
es: no se pudo compilar el vertex shader 2D

source: unable to link the 2D program
es: no se pudo enlazar el programa 2D

source: unable to compile the 3D vertex shader
es: no se pudo compilar el vertex shader 3D

source: unable to link the 3D program
es: no se pudo enlazar el programa 3D

source: unable to compile the 2D with color vertex shader
es: no se pudo compilar el vertex shader 2D con color

source: unable to link the 2D with color program
es: no se pudo enlazar el programa 2D con color

source: unable to compile the 3D with color vertex shader
es: no se pudo compilar el vertex shader 3D con color

source: unable to link the 3D with color program
es: no se pudo enlazar el programa 3D con color

source: unable to compile the text fragment shader
es: no se pudo compilar el fragment shader de texto

source: unable to compile the text vertex shader
es: no se pudo compilar el vertex shader de texto

source: unable to link the text program
es: no se pudo enlazar el programa de texto

source: could not bind 2D position attribute
es: no se pudo enlazar el atributo de posición 2D

source: could not bind 2D color
es: no se pudo enlazar el color 2D

source: could not bind 2D matrix
es: no se pudo enlazar la matriz 2D

source: could not bind 3D position attribute
es: no se pudo enlazar el atributo de posición 3D

source: could not bind 3D color
es: no se pudo enlazar el color 3D

source: could not bind 3D matrix
es: no se pudo enlazar la matriz 3D

source: could not bind 2D with color position attribute
es: no se pudo enlazar el atributo de posición 2D con color

source: could not bind 2D with color color
es: no se pudo enlazar el color 2D con color

source: could not bind 2D with color matrix
es: no se pudo enlazar la matriz 2D con color

source: could not bind 3D with color position attribute
es: no se pudo enlazar el atributo de posición 3D con color

source: could not bind 3D with color color
es: no se pudo enlazar el color 3D con color

source: could not bind 3D with color matrix
es: no se pudo enlazar la matriz 3D con color

source: could not bind text position attribute
es: no se pudo enlazar el atributo de posición de texto

source: could not bind text uniform
es: no se pudo enlazar el texto uniforme

source: could not bind text color uniform
es: no se pudo enlazar el color uniforme

source: not enough memory to init the FreeType library
es: memoria insuficiente para iniciar la biblioteca FreeType

source: could not init the FreeType library
es: no se pudo iniciar la biblioteca FreeType

source: not enough memory to open the font
es: memoria insuficiente para abrir la fuente

source: could not open font
es: no se pudo abrir la fuente

source: bad tics number
es: número de marcas incorrecto

source: not enough memory to open the graphic area
es: memoria insuficiente para abrir el área gráfica

source: unable to open the graphic area widget
es: no se pudo abrir el widget de área gráfica

source: unable to open the window
es: no se pudo abrir la ventana

source: PNG file
es: Fichero PNG

source: JPEG file
es: Fichero JPEG

source: XPM file
es: Fichero XPM

source: TIFF file
es: Fichero TIFF

source: BMP file
es: Fichero BMP

source: GIF file
es: Fichero GIF

source: ICO file
es: Fichero ICO

source: Save graph
es: Guardar gráfica

source: _OK
es: _Aceptar

source: _Cancel
es: _Cancelar

source: no a text editor type
es: no es un tipo de editor de texto

source: no an integer numbers editor type
es: no es un tipo de editor de números enteros

source: no a float numbers editor type
es: no es un tipo de editor de números reales

source: no a date editor type
es: no es un tipo de editor de fechas

source: bad array editor widget type
es: tipo incorrecto de widget de editor de matrices

source: not enough memory to open the array editor
es: memoria insuficiente para abrir el editor de matrices
