Repository: jburguete/jb
Catalog: 11.3.23/locale/*/LC_MESSAGES/jb.po
Languages: fr

source: unable to open the file
fr: impossible d'ouvrir le fichier

source: not enough memory to open the file
fr: mémoire insuffisante pour ouvrir le fichier

source: unable to read the file
fr: impossible de lire le fichier

source: Error!
fr: Erreur!

source: Warning!
fr: Attention!

source: unable to init SDL
fr: impossible d'initialiser SDL

source: unable to init GLFW
fr: impossible d'initialiser GLFW

source: unable to compile the texture fragment shader
fr: impossible de compiler le fragment shader de la texture

source: unable to compile the texture vertex shader
fr: impossible de compiler le vertex shader de la texture

source: unable to link the texture program
fr: impossible de lier le programme de la texture

source: could not bind texture attribute
fr: impossible de lier l'attribut de la texture

source: could not bind texture position attribute
fr: impossible de lier l'attribut de position de la texture

source: could not bind texture uniform
fr: impossible de lier la texture uniforme

source: could not bind matrix uniform
fr: impossible de lier la matrice uniforme

source: unable to open the PNG file
fr: impossible d'ouvrir le fichier PNG

source: not enough memory to open the widget
fr: mémoire insuffisante pour ouvrir le widget

source: not enough memory to open the image
fr: mémoire insuffisante pour ouvrir l'image

source: no Vulkan instance extensions supported
fr: aucune extension d'instance de Vulkan prise en charge

source: no VK_KHR_surface Vulkan extension
fr: aucune extension de surface VK_KHR de Vulkan

source: no available Vulkan validation layers
fr: aucune couche de validation de Vulkan disponible

source: failed to create Vulkan instance
fr: impossible de créer une instance de Vulkan

source: unable to create a Vulkan surface
fr: impossible de créer une surface de Vulkan

source: failed to find a GPU with Vulkan support
fr: impossible de trouver une GPU avec prise en charge de Vulkan

source: bad Vulkan physical devices
fr: mauvais périphériques physiques de Vulkan

source: no suitable Vulkan physical devices
fr: aucun périphérique physique de Vulkan appropié

source: no available Vulkan extension
fr: aucune extension de Vulkan disponible

source: no suitable Vulkan physical device queue family
fr: aucune famille de files d'attente de phériphériques physiques de Vulkan appropiée

source: Vulkan device does not support surfaces
fr: le périphérique de Vulkan ne prend pas en charge les surfaces

source: unable to create the Vulkan logical device
fr: impossible de créer le périphérique logique de Vulkan

source: unable to create the Vulkan swap chain
fr: impossible de créer la chaîne d'échange de Vulkan

source: unable to create the Vulkan swap chain image view
fr: impossible de créer la vue d'image de la chaîne d'échange de Vulkan

source: failed to find supported format
fr: impossible de trouver le format pris en charge

source: failed to create the Vulkan render pass
fr: impossible de créer la passe de rendu de Vulkan

source: failed to create the Vulkan descriptor set layout
fr: impossible de créer la mise en page de l'ensemble de descripteurs de Vulkan

source: failed to open the shader file
fr: impossible d'ouvrir le fichier de shader

source: failed to create the Vulkan shader module
fr: impossible de créer le module de shader de Vulkan

source: OpenGL 2.1 is not supported
fr: OpenGL 2.1 n'est pas pris en charge

source: unable to compile the fragment shader
fr: impossible de compiler le fragment shader

source: unable to compile the 2D vertex shader
fr: impossible de compiler le vertex shader 2D

source: unable to link the 2D program
fr: impossible de lier le programme 2D

source: unable to compile the 3D vertex shader
fr: impossible de compiler le vertex shader 3D

source: unable to link the 3D program
fr: impossible de lier le programme 3D

source: unable to compile the 2D with color vertex shader
fr: impossible de compiler le vertex shader 2D avec couleur

source: unable to link the 2D with color program
fr: impossible de lier le programme 2D avec couleur

source: unable to compile the 3D with color vertex shader
fr: impossible de compiler le vertex shader 3D avec couleur

source: unable to link the 3D with color program
fr: impossible de lier le programme 3D avec couleur

source: unable to compile the text fragment shader
fr: impossible de compiler le fragment shader de texte

source: unable to compile the text vertex shader
fr: impossible de compiler le vertex shader de texte

source: unable to link the text program
fr: impossible de lier le programme de texte

source: could not bind 2D position attribute
fr: impossible de lier l'attribut de position 2D

source: could not bind 2D color
fr: impossible de lier la couleur 2D

source: could not bind 2D matrix
fr: impossible de lier la matrice 2D

source: could not bind 3D position attribute
fr: impossible de lier l'attribut de position 3D

source: could not bind 3D color
fr: impossible de lier la couleur 3D

source: could not bind 3D matrix
fr: impossible de lier la matrice 3D

source: could not bind 2D with color position attribute
fr: impossible de lier l'attribut de position 2D avec couleur

source: could not bind 2D with color color
fr: impossible de lier la couleur 2D avec couleur

source: could not bind 2D with color matrix
fr: impossible de lier la matrice 2D avec couleur

source: could not bind 3D with color position attribute
fr: impossible de lier l'attribut de position 3D avec couleur

source: could not bind 3D with color color
fr: impossible de lier la couleur 3D avec couleur

source: could not bind 3D with color matrix
fr: impossible de lier la matrice 3D avec couleur

source: could not bind text position attribute
fr: impossible de lier l'attribut de position du texte

source: could not bind text uniform
fr: impossible de lier l'uniforme du texte

source: could not bind text color uniform
fr: impossible de lier la couleur du texte uniforme

source: not enough memory to init the FreeType library
fr: mémoire insuffisante pour initialiser la bibliothèque FreeType

source: could not init the FreeType library
fr: impossible d'initialiser la bibliothèque FreeType

source: not enough memory to open the font
fr: mémoire insuffisante pour ouvrir la police

source: could not open font
fr: impossible d'ouvrir la police

source: bad tics number
fr: nombre de tics incorrect

source: not enough memory to open the graphic area
fr: mémoire insuffisante pour ouvrir la zone graphique

source: unable to open the graphic area widget
fr: impossible d'ouvrir le widget de la zone graphique

source: unable to open the window
fr: impossible d'ouvrir la fenêtre

source: PNG file
fr: Fichier PNG

source: JPEG file
fr: Fichier JPEG

source: XPM file
fr: Fichier XPM

source: TIFF file
fr: Fichier TIFF

source: BMP file
fr: Fichier BMP

source: GIF file
fr: Fichier GIF

source: ICO file
fr: Fichier ICO

source: Save graph
fr: Enregistrer le graphique

source: _OK
fr: _Accepter

source: _Cancel
fr: _Annuler

source: no a text editor type
fr: pas un type d'éditeur de texte

source: no an integer numbers editor type
fr: pas un type d'éditeur de nombres entiers

source: no a float numbers editor type
fr: pas un type d'éditeur de nombres à virgule flottante

source: no a date editor type
fr: pas un type d'éditeur de dates

source: bad array editor widget type
fr: mauvais type de widget d'éditeur de tableau

source: not enough memory to open the array editor
fr: mémoire insuffisante pour ouvrir l'éditeur de tableau
